ARMmbed/mbed-os/targets/TARGET_Silicon_Labs/TARGET_EFM32/sl_crypto/src/sl_ecp.c
                    CRYPTO_CMD_INSTR_SELDDATA3DDATA2,
                    CRYPTO_CMD_INSTR_MSUB
                   );
  CRYPTO_DDataWrite(&CRYPTO->DDATA0, _2YY);
  MBEDTLS_MPI_CHK( ecp_crypto_ddata_read(&CRYPTO->DDATA0, &R->Y) );

 cleanup:
  return( ret );
}
#endif /* #if defined(MBEDTLS_ECP_DOUBLE_JAC_ALT) */

#if defined(MBEDTLS_ECP_DEVICE_ADD_MIXED_ALT)
/*
 * Alternative implementation of ecp_add_mixed using CRYPTO hardware
 * acceleration.
 *
 * Addition: R = P + Q, mixed affine-Jacobian coordinates (GECC 3.22)
 *
 * The coordinates of Q must be normalized (= affine),
 * but those of P don't need to. R is not normalized.
 *
 * We accept Q->Z being unset (saving memory in tables) as meaning 1.
 *
 * Cost: 1A := 8M + 3S
 */
int ecp_device_add_mixed( const mbedtls_ecp_group *grp, mbedtls_ecp_point *R,
                          const mbedtls_ecp_point *P, const mbedtls_ecp_point *Q )
{
  int    ret;
  (void) grp;
  
  /*
  STEP 1:

  Goals:
  A = Qx*Pz^2
  B = Qy*Pz^3
  
  Write Operations:
  
  R0 = Pz
  R0 = Qx
  R0 = Qy
  
  Instructions to be executed:
  
  1. R0 = DMA = Pz
  2. R1 = R0 = Pz
  3. R2 = R0 = Pz
  4. Select R1, R2
  5. R0 = R1 * R2 = Pz^2
  6. R1 = R0 = Pz^2

  7.  R0 = DMA = Qx
  8.  R3 = R0 = Qx
  9.  Select R1, R3
  10. R0 = R1 * R3 = Qx * Pz^2
  11. R3 = R0 = Qx * Pz^2

  12. Select R1, R2
  13. R0 = R1 * R2 = Pz^3
  14. R1 = R0 = Pz^3

  15. R0 = DMA = Qy
  16. R4 = R0 = Qx
  17. Select R1, R4
  18. R0 = R1 * R4 = Qy * Pz^3
  19. Select R0, R1  (for MSUB in step 2)
  
  Output State:
  R0   = B
  R1   = FREE
  R2   = FREE
  R3   = A
  R4   = Pz

  STEP 1:
  */
  CRYPTO_EXECUTE_19(CRYPTO,
                    CRYPTO_CMD_INSTR_DMA0TODATA,
                    CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                    CRYPTO_CMD_INSTR_DDATA0TODDATA4,
                    CRYPTO_CMD_INSTR_SELDDATA1DDATA4,
                    CRYPTO_CMD_INSTR_MMUL,
                    CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                    
                    CRYPTO_CMD_INSTR_DMA0TODATA,
                    CRYPTO_CMD_INSTR_DDATA0TODDATA3,
                    CRYPTO_CMD_INSTR_SELDDATA1DDATA3,
                    CRYPTO_CMD_INSTR_MMUL,
                    CRYPTO_CMD_INSTR_DDATA0TODDATA3,
                    
                    CRYPTO_CMD_INSTR_SELDDATA1DDATA4,
                    CRYPTO_CMD_INSTR_MMUL,
                    CRYPTO_CMD_INSTR_DDATA0TODDATA1,

                    CRYPTO_CMD_INSTR_DMA0TODATA,
                    CRYPTO_CMD_INSTR_DDATA0TODDATA2,
                    CRYPTO_CMD_INSTR_SELDDATA1DDATA2,
                    CRYPTO_CMD_INSTR_MMUL,
                    CRYPTO_CMD_INSTR_SELDDATA0DDATA1
                    );
  ecp_crypto_ddata_write(&CRYPTO->DDATA0, &P->Z);
  ecp_crypto_ddata_write(&CRYPTO->DDATA0, &Q->X);
  ecp_crypto_ddata_write(&CRYPTO->DDATA0, &Q->Y);

  /*
  STEP 2:

  Goals:
  C  = A - Px
  D  = B - Py
  R->Z = Pz * C
  
  Write Operations:
  
  R1 = Py
  R0 = Px (via DMA)

  Input State:
  R0   = B
  R1   = Py
  R2   = FREE
  R3   = A
  R4   = Pz
  
  Instructions to be executed:
  
  1. R0 = R0 - R2 = B - Py = D
  2. R2 = R0 = D
  3. R1 = R3 = A
  4. R0 = DMA = Px
  5. R3 = R0 = Px
  6. Select R1, R3
  7. R0 = R1 - R3 = A - Px = C
  8. R1 = R0 = C
  9. Select R1, R4
  10. R0 = R1 * R4 = Pz * C = R->Z
  11. R4 = R1 = C
  
  Read Operations:     
  
  R->Z = R0 = Pz * C

  Output State:
  R0   = FREE
  R1   = C
  R2   = D
  R3   = Px
  R4   = FREE
  
  STEP 2:
  */
  
  ecp_crypto_ddata_write(&CRYPTO->DDATA1, &P->Y);
  CRYPTO_EXECUTE_11(CRYPTO,
                    CRYPTO_CMD_INSTR_MSUB,
                    CRYPTO_CMD_INSTR_DDATA0TODDATA2, /* R2 = D */

                    CRYPTO_CMD_INSTR_DDATA3TODDATA1,
                    CRYPTO_CMD_INSTR_DMA0TODATA,
                    CRYPTO_CMD_INSTR_DDATA0TODDATA3,
                    CRYPTO_CMD_INSTR_SELDDATA1DDATA3,
                    CRYPTO_CMD_INSTR_MSUB,
                    CRYPTO_CMD_INSTR_DDATA0TODDATA1,  /* R1 = C */
                   
                    CRYPTO_CMD_INSTR_SELDDATA1DDATA4,
                    CRYPTO_CMD_INSTR_MMUL,
                    CRYPTO_CMD_INSTR_DDATA1TODDATA4
                    );
  ecp_crypto_ddata_write(&CRYPTO->DDATA0, &P->X);
  MBEDTLS_MPI_CHK( ecp_crypto_ddata_read(&CRYPTO->DDATA0, &R->Z) );

  /*
  STEP 3:
    
  Goals:
  X1C2  = Px * C^2
  C3    = C^3
  D2    = D^2
  
  Input State:
  R0   = FREE
  R1   = C
  R2   = D
  R3   = Px
  R4   = FREE

  Instructions to be executed:
  
  1. R0 = R1 * R4 = C^2
  2. R1 = R0 = C^2
  3. R0 = R1 * R4 = C^3
  4. R4 = R0 = C^3
  5. Select R1, R3
  6. R0 = R1 * R3 = Px * C^2
  7. R3 = R0 = Px * C^2
  8. R1 = R2 = D
  9. Select R1, R1
  10. R0 = R1 * R1 = D^2
  11. Select R0, R4   (for MSUB operation in next sequence)
  
  Output state:
  
  R0 = D2
  R1 = FREE
  R2 = D
  R3 = X1C2 = Px * C^2
  R4 = C3   = C^3
  
  STEP 3:
  */
  CRYPTO_EXECUTE_11(CRYPTO,
                    CRYPTO_CMD_INSTR_MMUL,
                    CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                    CRYPTO_CMD_INSTR_MMUL,
                    CRYPTO_CMD_INSTR_DDATA0TODDATA4,
                    CRYPTO_CMD_INSTR_SELDDATA1DDATA3,
                    CRYPTO_CMD_INSTR_MMUL,
                    CRYPTO_CMD_INSTR_DDATA0TODDATA3,
                    CRYPTO_CMD_INSTR_DDATA2TODDATA1,
                    CRYPTO_CMD_INSTR_SELDDATA1DDATA2,
                    CRYPTO_CMD_INSTR_MMUL,
                    CRYPTO_CMD_INSTR_SELDDATA0DDATA4
                    );
  /*       
  STEP 3:
           
  Goals:
  R->X   = D2 - (C3 + 2 * X1C2) = D2 - C3 - X1C2- X1C2
  Y1C3 = Py * C3
  R->Y = D * (X1C2 - R->X) - Y1C3

  Write Operations:
  R1 = Py

  Input State:  
  R0 = D2
  R1 = FREE
  R2 = D
  R3 = X1C2
  R4 = C3
  
  Instructions to be executed:
  
  1.  R0 = R0 - R4 = D2 - C3
  2.  Select R0, R3
  3.  R0 = R0 - R3 = D2 - C3 - X1C2
  4.  R0 = R0 - R3 = D2 - C3 - X1C2 - X1C2 = R->X
  5.  DMA = R0 = R->X
  6.  R1 = R0 = R->X

  7.  Select R3, R1
  8.  R0 = R3 - R1 = X1C2 - R->X
  9.  R1 = R0 = X1C2 - R->X
  10. Select R1, R2
  11. R0 = R1 * R2 = D *(X1C2 - R->X)
  12. R2 = R0

  13. R0 = DMA = Py
  14. R1 = R0 = Py
  15. Select R1, R4
  16. R0 = R1 * R4 = Py * C3 = Y1C3
  17. R4 = R0 = Y1C3

  18. Select R2, R4
  19. R0 = R2 - R4 
  
