ARMmbed/mbed-os/targets/TARGET_Silicon_Labs/TARGET_EFM32/sl_crypto/src/sl_ecp.c
    /*
     * u = 1 / (Z_0 * ... * Z_n) mod P
     */
    mbedtls_mpi_div_mod(one, cc[t_len-1], modulus, uu);

    for( i = t_len - 1; ; i-- )
    {
        /*
         * Zi = 1 / Z_i mod p
         * u = 1 / (Z_0 * ... * Z_i) mod P
         */
        if( i == 0 )
        {
            /* Z_inv (DDATA2) = uu */
            CRYPTO_DDataWrite(&CRYPTO->DDATA2, uu);
        }
        else
        {
            /* Z_inv (DDATA1) = uu x cc[i-1] modulo p */
            /* uu = uu x T[i]->Z modulo p */
            CRYPTO_DDataWrite(&CRYPTO->DDATA1, uu);
            CRYPTO_DDataWrite(&CRYPTO->DDATA2, cc[i-1]);
            ecp_crypto_ddata_write( &CRYPTO->DDATA3, &T[i]->Z );
            CRYPTO_EXECUTE_5(CRYPTO,
                             CRYPTO_CMD_INSTR_SELDDATA1DDATA2,
                             CRYPTO_CMD_INSTR_MMUL,
                             CRYPTO_CMD_INSTR_DDATA0TODDATA2, /* Z_inv (DDATA2) */
                             CRYPTO_CMD_INSTR_SELDDATA1DDATA3,
                             CRYPTO_CMD_INSTR_MMUL);
            CRYPTO_DDataRead(&CRYPTO->DDATA0, uu);
        }

        /*
         * proceed as in normalize()
         */
        ecp_crypto_ddata_write(&CRYPTO->DDATA3, &T[i]->X);
        ecp_crypto_ddata_write(&CRYPTO->DDATA4, &T[i]->Y);

        /* Z_inv  already in DDATA2 */
        CRYPTO_EXECUTE_12(CRYPTO,
                          CRYPTO_CMD_INSTR_DDATA2TODDATA1,
                          CRYPTO_CMD_INSTR_SELDDATA1DDATA2,
                          CRYPTO_CMD_INSTR_MMUL,
                          CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                          CRYPTO_CMD_INSTR_SELDDATA1DDATA3,
                          CRYPTO_CMD_INSTR_MMUL,
                          CRYPTO_CMD_INSTR_DDATA0TODDATA3,
                          CRYPTO_CMD_INSTR_SELDDATA1DDATA2,
                          CRYPTO_CMD_INSTR_MMUL,
                          CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                          CRYPTO_CMD_INSTR_SELDDATA1DDATA4,
                          CRYPTO_CMD_INSTR_MMUL
                          );

        ecp_crypto_ddata_read(&CRYPTO->DDATA0, &T[i]->Y);
        ecp_crypto_ddata_read(&CRYPTO->DDATA3, &T[i]->X);

        /*
         * Post-precessing: reclaim some memory by shrinking coordinates
         * - not storing Z (always 1)
         * - shrinking other coordinates, but still keeping the same number of
         *   limbs as P, as otherwise it will too likely be regrown too fast.
         */
        MBEDTLS_MPI_CHK( mbedtls_mpi_shrink( &T[i]->X, grp->P.n ) );
        MBEDTLS_MPI_CHK( mbedtls_mpi_shrink( &T[i]->Y, grp->P.n ) );
        mbedtls_mpi_free( &T[i]->Z );

        if( i == 0 )
            break;
    }

cleanup:

    mbedtls_free( cc );

    return( ret );
}
#endif /* #if defined( MBEDTLS_ECP_NORMALIZE_JAC_MANY_ALT ) */

#endif /* #if defined( CRYPTO_COUNT ) && ( CRYPTO_COUNT > 0 ) */

#endif /* #if !defined( MBEDTLS_SLCL_PLUGINS ) */

#endif /* #if defined( MBEDTLS_ECP_DEVICE_ALT ) */

#endif /* #if defined( MBEDTLS_ECP_C ) */
